{
  "projects": [
    {
      "id": 0,
      "project_name": "Random Quote Generator",
      "description": "This project uses JavaScript loops, arrays and objects as it displays a quote picked randomly from an array of 8 quotes that I put together. Each quote has properties such as text, source, citation and date. In my code I utilized two functions to select a random quote and to print the random quote to the web page. Click the Live Demo link to find inspiration from the quotes.",
      "technologies": [
        "JavaScript",
        "HTML",
        "CSS",
        "Visual Studio Code editor",
        "GitHub"
      ],
      "live_link": "https://lifelearner2.github.io/unit1RandomQuoteGenerator/",
      "github_link": "https://github.com/lifelearner2/unit1RandomQuoteGenerator",
      "image_urls": [
        "/static/images/randomQuote1.jpg",
        "/static/images/randomQuote2.jpg"
      ]
    },
    {
      "id": 1,
      "project_name": "Data Pagination & Filtering",
      "description": "This project involved data, objects, DOM manipulation and writing pagination to enhance visibility of web page. My code takes an array of student objects, displays a list on the page with each student and then paginates them in multiples of 9. Users can use the numbered buttons to click to through each page. Click the Live Demo link to try it out.",
      "technologies": [
        "JavaScript", 
        "CSS", 
        "VS Code", 
        "GitHub"
      ],
      "live_link": "https://lifelearner2.github.io/data-pagination-and-filtering-v1/",
      "github_link": "https://github.com/lifelearner2/data-pagination-and-filtering-v1",
      "image_urls": [
        "/static/images/dataPagination1.jpg",
        "/static/images/dataPagination2.jpg"
      ]
    },
    {
      "id": 2,
      "project_name": "Interactive Form",
      "description": "I took a basic web form and used JavaScript to add interactivity and enhance usability, I incorporated live validators to check for correct information that gives immediate feedback to the user. I implemented a focus feature which placed the cursor in the first text field once the page is loaded. I also implemented live interactivity on the form based on the user's selection with the job role, t-shirt, total cost and payment sections. Validation also provides feedback to the user if they attempt to submit the form without it being complete. I used regex in my code to provide parameters for the credit card and zip code fields. My code involved conditionals, regular expressions and string manipulation. Click the Live Demo link to try out the form (please be advised that any information you submit will not be submitted anywhere as it is a demo form).",
      "technologies": [
        "JavaScript",
        "HTML",
        "Accessibility",
        "VS Code",
        "GitHub"
      ],
      "live_link": "https://lifelearner2.github.io/interactive-form-v3/",
      "github_link": "https://github.com/lifelearner2/interactive-form-v3",
      "image_urls": [
        "/static/images/interactiveForm1.jpg",
        "/static/images/interactiveForm2.jpg"
      ]
    },
    {
      "id": 3,
      "project_name": "Object Oriented Programming - Phrase Hunter Game",
      "description": "I created a browser-based, word guessing game. I used JavaScript and Object-Oriented Programming to select a random, hidden phrase.  My code entails callback functions, JavaScript array iteration methods, constructors, JavaScript classes and manipulating the HTML DOM. Click the Live Demo link to play this fun game and see if you can guess all 5 of my phrases.",
      "technologies": [
        "JavaScript", 
        "HTML", 
        "CSS", 
        "OOP", 
        "VS Code", 
        "GitHub"
      ],
      "live_link": "https://lifelearner2.github.io/oop_game-v2-1-/",
      "github_link": "https://github.com/lifelearner2/oop_game-v2-1-",
      "image_urls": [
        "/static/images/phraseHunter1.jpg",
        "/static/images/phraseHunter2.jpg",
        "/static/images/phraseHunter3.jpg",
        "/static/images/phraseHunter4.jpg",
        "/static/images/phraseHunter5.jpg"
      ]
    },
    {
      "id": 4,
      "project_name": "Public API Requests",
      "description": "I created a faux Employee Directory by using JavaScript to communicate with an API (Application Programming Interface) site using AJAX to retrieve random user information to be displayed in my directory. I also added a modal dialog box to focus on one employee and their info as well as added buttons for functionality. New users populated to the directory when the page is refreshed. If you're interested in pulling tweets from Twitter to display on your webpage in real time, the skills I used in this project would lend itself to making your webpage update with tweets from Twitter. Check out the Live Demo or take a peek at my code in my Github Repo. ",
      "technologies": [
        "Fetch and Public API's", 
        "Terminal",
        "Git and Github",
        "HTTP",
        "AJAX",
        "VS Code",
        "JavaScript"
      ],
      "live_link": "https://lifelearner2.github.io/Public_API_Requests_Techdegree_Unit-5/",
      "github_link": "https://github.com/lifelearner2/Public_API_Requests_Techdegree_Unit-5",
      "image_urls": [
        "/static/images/publicAPI1.jpg",
        "/static/images/publicAPI2.jpg"
      ]
    }
  ]
}
